quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
#ifdef AMP01V14A1

#include "AMP01V14A1.H"

#include	"AMP_Protocol.H"

#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"
#include "STM32_SPI.H"

#include "SWITCHID.H"
#include "IOT5302W.H"     //读卡器

#include 	"CRC.H"

#include "string.h"				//串和内存操作函数头文件

//------------------锁接口J10
#define ampSYSLEDPort    GPIOA         //锁控制接口，高电平开锁
#define ampSYSLEDPin     GPIO_Pin_0
//------------------通讯接口--PC
#define ampCommPcPort        USART2
//------------------通讯接口--柜口
#define ampCommCbPort       USART1
#define ampCommCbTxEnPort  	GPIOA         //锁控制接口，高电平开锁
#define ampCommCbTxEnPin   	GPIO_Pin_8
#define ampCommCbRxEnPort 	GPIOC
#define ampCommCbRxEnPin		GPIO_Pin_9
//------------------通讯接口--层板接口
#define ampCommLayPort     	UART4
#define ampCommLayTxEnPort 	GPIOA         //锁控制接口，高电平开锁
#define ampCommLayTxEnPin  	GPIO_Pin_12
#define ampCommLayRxEnPort 	GPIOA
#define ampCommLayRxEnPin		GPIO_Pin_11
//------------------通讯接口--读卡器接口
#define ampCommCardPort    	USART3
#define ampCommCardTxEnPort 	GPIOC         //锁控制接口，高电平开锁
#define ampCommCardTxEnPin  	GPIO_Pin_8
#define ampCommCardRxEnPort 	GPIOC
#define ampCommCardRxEnPin		GPIO_Pin_7
#define ampCommCardBaudRate  9600         //读卡器通讯波特率

//------------------锁接口J10
#define ampLockDrPort    GPIOB         //锁控制接口，高电平开锁
#define ampLockDrPin     GPIO_Pin_1
#define ampLockSiPort    GPIOC         //锁信号，检测到低电平表示锁已开
#define ampLockSiPin     GPIO_Pin_12
#define ampUnLock        ampLockDrPort->BSRR  = ampLockDrPin    //开锁
#define ampResLock       ampLockDrPort->BRR   = ampLockDrPin    //释放锁驱动
#define ampGetLockSts    (ampLockSiPort->IDR & ampLockSiPin)      //获取锁的状态，如果为0，表示锁已开
//------------------背光接口J11的VCC和EN脚
#define ampBackLightPort GPIOB         //高电平关闭，低电平点亮
#define ampBackLightPin  GPIO_Pin_0
#define ampBakkLightOff	(ampBackLightPort->BRR 	= ampBackLightPin)
#define ampBakkLightOn	(ampBackLightPort->BSRR = ampBackLightPin)
//#define ampBakkLightOff	PWM_OUT(TIM3,PWM_OUTChannel3,100,800)	//PWM设定-20161127版本	占空比1/1000
//#define ampBakkLightOn	PWM_OUT(TIM3,PWM_OUTChannel3,100,990)	//PWM设定-20161127版本	占空比1/1000

////-----透明屏反向控制LED
//#define ampBakkLightOff	(ampBackLightPort->BSRR 	= ampBackLightPin)
//#define ampBakkLightOn	(ampBackLightPort->BRR = ampBackLightPin)

//------------------层板电源控制J5、J6、J9共用一个控制电源
#define ampLayPowerPort  GPIOB         //高电启动电源，低电平关闭电源
#define ampLayPowerPin   GPIO_Pin_2
#define ampLayPowerOn    ampLayPowerPort->BSRR = ampLayPowerPin   //启动电源
#define ampLayPowerOff   ampLayPowerPort->BRR  = ampLayPowerPin   //关闭电源

//#define ampReSendTime					50		//ms
//#define ampUnlockOuttime   		2000      	//开锁倒计时超时时间
//#define ampMaxResendCount  		5         	//最大发送次数
/* Private variables ---------------------------------------------------------*/

static RS485Def ampRS485Ly;   //uart4,PA15   		//层板接口
static RS485Def ampRS485Cb;   //usart1,PA8    	//副柜接口
//static RS485Def ampRS485Card; //usart3,PB2    //读卡器接口
static SwitchDef ampSwitchID;
static spi_def stLed;

ampdef ampsys;

//----------------------------------调试数据
//unsigned char rxd[maxFramesize];



/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void API_AMP01V14A1_Configuration(void)
{	
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H	
	
	Hardware_Configuration();

  GPIO_Configuration_OPP50(ampSYSLEDPort,ampSYSLEDPin);

	//SysTick_DeleymS(500);				//SysTick延时nmS
  PWM_OUT(TIM2,PWM_OUTChannel1,2,500);	//PWM设定-20161127版本	占空比1/1000
	
	IWDG_Configuration(3000);			//独立看门狗配置---参数单位ms
  
  SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
  
  while(1)
  {
  }
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void API_AMP01V14A1_Server(void)
{ 
	IWDG_Feed();								//独立看门狗喂狗
	test_cabinet_address_none_process();		//未拨码柜接口发LCD测试程序
	set_time_sync_frame();									//未拨码柜接口发LCD测试程序
	Tim_Server();
  door_server();
  SwitchID_Server();
	status_server();
  Led_Server();
	Pc_Server();
	Cab_Server();
	Lay_Server();
	CardReader_Server();
}
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void status_server(void)
{
	static unsigned char i=0;
	static ampStadef status;		//刚上电状态
	//-----------------------------刚上电等待数据稳定
	if(i<100)
	{
		i++;
		status	=	ampsys.status;
		return;
	}
	if(ampGetLockSts)	//关门状态
	{
		ampsys.status.lock	=	1;
	}
	//-----------------------------检查有无状态变化
	if(0!=memcmp((unsigned char*)&status,(unsigned char*)&ampsys.status,2))	//状态有变化.short类型为两个char长度
	{
		if(status.lock	!=	ampsys.status.lock)
		{
			set_lock_status_frame();
			status.lock	=	ampsys.status.lock;
		}
	}
//	ampsys.Sta.lockstd=0;
}
//------------------------------------------------------------------------------


//--------------------------------static-cache_buffer
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_addr(ampPortDef port)
{
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.Pc.Data;
	else if(CabPort	==	port)
		return ampsys.Cab.Data;
	else if(LayPort	==	port)
		return ampsys.Lay.Data;
	else
		return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned short set_cache_data(ampPortDef port,ampphydef* frame)
{
	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char 	lay_addr	=	0;	//层地址	
	unsigned short	i=0;
	unsigned short  lastarry  = 0;
	unsigned short	len	=	0;
	unsigned char*	pBuffer	=	(unsigned char*)frame;
	ampCachedef* Cache	= get_cache_addr(port);

