quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
	if(0==Cache)	//返回空地址
		return 0;
	if(0==frame)	//
		return 0;
	
	cab_addr	=	frame->msg.addr.address1;	//柜地址
	lay_addr	=	frame->msg.addr.address2;	//层地址
	
	//-------------------------地址检查
	if((CabPort==port)&&(0x00==cab_addr))	//无柜地址
		return 0;
	if((LayPort==port)&&(0x00==lay_addr))	//无层地址
		return 0;
		
	
	//-------------------------检查数据有无溢出
	len	=	frame->msg.length+5;	//head,len,crcl.crch.end
	if(maxFramesize<len)
		return 0;
	//-------------------------检查缓存中有无相同数据及查找当前最大缓存序号
	for(i=0;i<ampArrySize;i++)
	{
		if(Cache[i].arry>lastarry)		//缓存数据不为0
		{
			lastarry	=	Cache[i].arry;	//当前最大的序号	
			if(len	==	Cache[i].size)
			{
				if(0  ==  memcmp(Cache[i].data,pBuffer,len)) //比较相同
				{
					return len;		//已有相同数据，退出，表示存储成功
				}
			}
		}
	}
	//-------------------------未在缓存中找到相同的数据
	//-------------------------判断缓存是否为满
	if(lastarry>=ampArrySize)	//从0开始
	{
		//缓存满
		return 0;
	}
	lastarry+=1;
	for(i=0;i<ampArrySize;i++)
  {
    if(0  ==  Cache[i].arry)  //0编号表示此为空缓存
    {
      memcpy(Cache[i].data,pBuffer,len);
      Cache[i].arry = lastarry;             //此缓存在发送队列中的排序
      Cache[i].size = len; 
      return  len;
    }
  }
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static ampCachedef* get_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{		
		if(1==Cache[i].arry)		//缓存数据不为0
		{
			return &Cache[i];
		}
	}
	return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char del_cache_data(ampPortDef port)
{
	unsigned short	i=0;
	ampCachedef* Cache	= get_cache_addr(port);
	
	if(0==Cache)	//返回空地址
		return 0;
	//-------------------------先发送缓存标号为1号数据
	for(i=0;i<ampArrySize;i++)
	{
		if((Cache[i].arry))
		{
			Cache[i].arry-=1;
		}
	}
	return 1;
}
//------------------------------------------------------------------------------


//--------------------------------static-ack_flag
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static unsigned char get_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return 0;
	else if(PcPort	==	port)
		return ampsys.AckW.PC;
	else if(CabPort	==	port)
		return ampsys.AckW.CB;
	else if(LayPort	==	port)
		return ampsys.AckW.LY;
	else
		return 0;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return;
	else if(PcPort	==	port)
		ampsys.AckW.PC =	1;
	else if(CabPort	==	port)
		ampsys.AckW.CB =	1;
	else if(LayPort	==	port)
		ampsys.AckW.LY =	1;
	else
		return;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void del_ack_wait_flag(ampPortDef port)
{
	//0--无需等待应答，1--需等待应答
	if(NonPort	==	port)
		return;
	else if(PcPort	==	port)
		ampsys.AckW.PC =	0;
	else if(CabPort	==	port)
		ampsys.AckW.CB =	0;
	else if(LayPort	==	port)
		ampsys.AckW.LY =	0;
	else
		return;
}
//------------------------------------------------------------------------------


//--------------------------------static-port_server
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Pc_Server(void)
{
	pc_receive_data_process();
	pc_send_data_process();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Cab_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	cab_receive_data_process();
	//================================================数据发送	
	cab_send_data_process();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void Lay_Server(void)
{
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	lay_receive_data_process();
	lay_send_data_process();
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void CardReader_Server(void)
{
	unsigned char uid[16]={0};
	unsigned char len	=	0;
	api_iot5302w_server();
	len	= api_get_iot5302w_uid(uid);
	if(4==len)
	{
		ampphydef  ampframe;
	
		ampframe.head	=	headcode;
		ampframe.msg.length		=	8;
		ampframe.msg.cmd.cmd	=	ampCmdCard;
		ampframe.msg.cmd.rv		=	0;
		ampframe.msg.cmd.dir	=	1;
		ampframe.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
		ampframe.msg.addr.address2	=	0;
		ampframe.msg.addr.address3	=	0;
		ampframe.msg.data[0]	=	uid[0];
		ampframe.msg.data[1]	=	uid[1];
		ampframe.msg.data[2]	=	uid[2];
		ampframe.msg.data[3]	=	uid[3];
		
		api_set_frame(&ampframe,ampCmdCard,1);
		if(ampsys.sysdata.MB_Flag)	//主板
			set_cache_data(PcPort,&ampframe);
		else
			set_cache_data(CabPort,&ampframe);
		
