quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
		//--------------------------LED指示灯
		ampsys.led.flag.rf_rx	=	1;
		ampsys.led.time.rf_rx	=	ampledtime;
	}
}

//------------------------------------------------------------------------------


//--------------------------------static-port_data_process
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void pc_receive_data_process(void)
{  
	unsigned char		cmd	=	ampCmdNone;
	unsigned short 	rxnum=0;
	unsigned char 	rxd[maxFramesize];
	
	ampphydef* frame;
	
	rxnum	=	api_usart_dma_receive(ampCommPcPort,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	if(0==rxnum)
	{
		return;
	}	
	frame	=	api_get_frame(rxd,rxnum);
	//--------------------------LED指示灯
	ampsys.led.flag.pc_rx	=	1;
	ampsys.led.time.pc_rx	=	ampledtime;
	if(0==frame)
		return;
	cmd	=	frame->msg.cmd.cmd;
	//------------------------------------------检查是否为应答
	if(ampCmdAck==cmd)	//应答，删除一缓存
	{
		//------------------------------------------应答
		unsigned char wait_ack	=	get_ack_wait_flag(PcPort);
		if(wait_ack)
		{
			ampsys.ReSend.Pc	=	0;
			ampsys.time.PcSendTime	=	5;
			del_cache_data(PcPort);
			del_ack_wait_flag(PcPort);
		}
		return ;
	}
	//------------------------------数据转发到层板
	if((ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)||(0xFF==frame->msg.addr.address1))
	{
		set_cache_data(LayPort,frame);		//发往本柜层板
	}
	//------------------------------数据转发到其它柜
	if((ampsys.sysdata.Cab_Addr!=frame->msg.addr.address1)||(0xFF==frame->msg.addr.address1))
	{
		set_cache_data(CabPort,frame);		//发往其它柜
	}
	//------------------------------命令处理
	if((ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)||(0xFF==frame->msg.addr.address1))
	{
		cmd_process(frame);		
	}
	set_ackup_frame(PcPort);	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void pc_send_data_process(void)
{
	unsigned short sendnum=0;
	ampCachedef*	Cache;
	
	if(0!=ampsys.time.PcSendTime)
	{
		return;
	}	
	//----------------------------------------------检查有无应答数据要发送
	if(ampsys.Pc.Ack.flag)
	{
		unsigned char* addr	=	&ampsys.Pc.Ack.head;
		sendnum	=	api_usart_dma_send(ampCommPcPort,addr,ampAckSize);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.Pc.Ack.flag	=	0;
			ampsys.time.PcSendTime	=	2;
			del_ack_wait_flag(PcPort);		//0--无需等待应答，1--需等待应答				
		}
		return;
	}		
	//----------------------------------------------发送数据：清除超出发送次数的缓存，上报连接超时；广播数据只发固定再次
	//----------上报PC只发再次
	if(ampsys.ReSend.Pc>=1)
	{
		ampsys.ReSend.Pc	=	0;
		del_cache_data(PcPort);
	}
	Cache	=	get_cache_data(PcPort);
	if(0==Cache)	//无数据
	{
		ampsys.ReSend.Pc	=	0;
		return;
	}
	sendnum	=	api_usart_dma_send(ampCommPcPort,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
	if(sendnum)	//已将数据转移到缓存
	{	
		set_ack_wait_flag(PcPort);	//0--无需等待应答，1--需等待应答
		ampsys.ReSend.Pc+=1;			
		ampsys.time.PcSendTime	=	ampReSendTime;
		
		//--------------------------LED指示灯
		ampsys.led.flag.pc_tx	=	1;
		ampsys.led.time.pc_tx	=	ampledtime;
	}
}
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void cab_receive_data_process(void)
{  
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	unsigned char 	cab_addr	=	0;	//柜地址
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
//	unsigned short	Saved_len	=	0;	
	unsigned short 	rxnum=0;
	
	ampphydef* frame;
	unsigned char 	rxd[maxFramesize];
	//================================================数据接收
	rxnum	=	api_rs485_dma_receive(&ampRS485Cb,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	if(0==rxnum)
	{
		return;
	}	
	frame	=	api_get_frame(rxd,rxnum);
	if(0==frame)
		return;
	//--------------------------LED指示灯
	ampsys.led.flag.cb_rx	=	1;
	ampsys.led.time.cb_rx	=	ampledtime;
	
	cmd	=	frame->msg.cmd.cmd;
	dir	=	frame->msg.cmd.dir;
	//------------------------------------------检查数据传输方向，如果是辅柜，只接收下发数据，如果是主柜，只接收上传数据
	if(ampsys.sysdata.MB_Flag)	//主柜
	{
		if(0==dir)	//下发
			return;
	}
	else
	{
		if(1==dir)	//上传
			return;
	}
	//------------------------------------------检查是否为应答
	if(ampCmdAck==cmd)	//应答，删除一缓存
	{	
		//------------------------------------------应答
		unsigned char wait_ack	=	get_ack_wait_flag(CabPort);
		if(wait_ack)
		{
			ampsys.ReSend.Cab	=	0;
			ampsys.time.CabSendTime	=	2;
			del_cache_data(CabPort);
			del_ack_wait_flag(CabPort);
		}
		return ;
	}
	//------------------------------------------主柜数据转发到PC
	if(ampsys.sysdata.MB_Flag)	//主柜
	{
		set_cache_data(PcPort,frame);			//发往PC缓存
		set_ackdown_frame(CabPort);
		return;
	}
	//------------------------------数据转发到层板
	if((ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)||(0xFF==frame->msg.addr.address1))
	{
		set_cache_data(LayPort,frame);
	}
	//------------------------------命令处理
	if((ampsys.sysdata.Cab_Addr==frame->msg.addr.address1)||(0xFF==frame->msg.addr.address1))
	{
		cmd_process(frame);
	}
	//------------------------------:应答;只对本地址数据应答
	if((0xFF!=cab_addr)&&(ampsys.sysdata.Cab_Addr==frame->msg.addr.address1))	//广播数据:不应答
	{
		//----------------------------此为辅柜
		set_ackup_frame(CabPort);
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cab_send_data_process(void)
{	
	unsigned short sendnum=0;
	ampCachedef*	Cache;
	ampphydef* frame;
	
