quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
	if(0!=ampsys.time.CabSendTime)
	{
		return;
	}		
	//----------------------------------------------检查有无应答数据要发送
	if(ampsys.commdata.CbAck.size)
	{
		Cache	=	&ampsys.commdata.CbAck;
		sendnum	=	api_rs485_dma_send(&ampRS485Cb,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.commdata.CbAck.size	=	0;
			del_ack_wait_flag(CabPort);	//0--无需等待应答，1--需等待应答
			ampsys.time.CabSendTime		=	10;
		}
		return;
	}
	//----------------------------------------------检查有无发送超时
	if(ampsys.ReSend.Cab>=ampMaxResendCount)
	{			
		Cache	=	get_cache_data(CabPort);
		if(0!=Cache)	//有数据
		{
			frame	=	(ampphydef*)Cache->data;
			ampsys.ReSend.Cab	=	0;			
			if(ampsys.sysdata.MB_Flag)	//主柜
			{
				set_comm_time_out_frame(PcPort,frame);
			}
			else
			{
				set_comm_time_out_frame(CabPort,frame);
			}
			del_cache_data(CabPort);
		}
	}
	//----------------------------------------------发送数据：广播数据只发两次
	Cache	=	get_cache_data(CabPort);
	if(0==Cache)	//无数据
	{
		ampsys.ReSend.Cab	=	0;
		ampsys.time.CabSendTime		=	5;
		return;
	}	
	//----------------------------------------------
	sendnum	=	api_rs485_dma_send(&ampRS485Cb,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
	if(sendnum)	//已将数据转移到缓存
	{	
		frame	=	(ampphydef*)Cache->data;		
		ampsys.ReSend.Cab+=1;			
		ampsys.time.CabSendTime	=	ampReSendTime;
		
		//--------------------------LED指示灯
		ampsys.led.flag.cb_tx	=	1;
		ampsys.led.time.cb_tx	=	ampledtime;
		
		//----------------------------------------------广播数据只发两次，不需要应答
		if(0xFF==frame->msg.addr.address1)	//广播地址
		{
			if(ampsys.ReSend.Cab>=2)
			{
				ampsys.ReSend.Cab=0;
				del_cache_data(CabPort);
				del_ack_wait_flag(CabPort);			//0--无需等待应答，1--需等待应答
				return;
			}
		}
		else
		{
			set_ack_wait_flag(CabPort);			//0--无需等待应答，1--需等待应答
		}
	}		
}
/*******************************************************************************
* 函数名			:	Cmd_Process
* 功能描述		:	柜消息处理：处理针对本柜的消息/命令
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
static void lay_receive_data_process(void)
{  
	//--------------------------------------
	//主板:接收PC数据，广播数据，内部使用和转发
	//接收到总线数据，上传到PC
	unsigned char		cmd	=	ampCmdNone;
	unsigned char		dir	=	0;
	unsigned short 	rxnum=0;
	
	ampphydef* frame;
	unsigned char 	rxd[maxFramesize];
	//================================================数据接收
	rxnum	=	api_rs485_dma_receive(&ampRS485Ly,rxd);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数
	if(0==rxnum)
	{
		return;
	}
	frame	=	api_get_frame(rxd,rxnum);
	if(0==frame)
		return;
	//--------------------------LED指示灯
	ampsys.led.flag.ly_rx	=	1;
	ampsys.led.time.ly_rx	=	ampledtime;
	
	cmd	=	frame->msg.cmd.cmd;
	dir	=	frame->msg.cmd.dir;
	//------------------------------------------检查数据传输方向，层接口只接收上传
	if(0==dir)	//下发
		return;
	//------------------------------------------检查是否为应答
	if(ampCmdAck==cmd)	//应答，删除一缓存
	{	
		//------------------------------------------应答
		unsigned char wait_ack	=	get_ack_wait_flag(LayPort);
		if(wait_ack)
		{
			ampsys.ReSend.Lay	=	0;
			ampsys.time.LaySendTime	=	2;
			del_cache_data(LayPort);
			del_ack_wait_flag(LayPort);
		}
		return ;
	}
	//------------------------------------------主柜数据转发到PC
	if(ampsys.sysdata.MB_Flag)	//主柜
	{
		set_cache_data(PcPort,frame);			//发往PC缓存
		set_ackdown_frame(LayPort);
		return;
	}
	else
	{
		set_cache_data(CabPort,frame);
		set_ackdown_frame(LayPort);
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void lay_send_data_process(void)
{	
	unsigned short sendnum=0;
	ampCachedef*	Cache;
	ampphydef* frame;
	
	if(0!=ampsys.time.LaySendTime)
	{
		return;
	}		
	//----------------------------------------------检查有无应答数据要发送
	if(ampsys.commdata.LyAck.size)
	{
		Cache	=	&ampsys.commdata.CbAck;
		sendnum	=	api_rs485_dma_send(&ampRS485Ly,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
		if(sendnum)	//已将数据转移到缓存
		{	
			ampsys.commdata.LyAck.size	=	0;
			del_ack_wait_flag(LayPort);	//0--无需等待应答，1--需等待应答
			ampsys.time.LaySendTime		=	10;
		}
		return;
	}
	//----------------------------------------------检查有无发送超时
	if(ampsys.ReSend.Lay>=ampMaxResendCount)
	{			
		Cache	=	get_cache_data(LayPort);
		if(0!=Cache)	//有数据
		{
			frame	=	(ampphydef*)Cache->data;
			ampsys.ReSend.Lay	=	0;			
			if(ampsys.sysdata.MB_Flag)	//主柜
			{
				set_comm_time_out_frame(PcPort,frame);
			}
			else
			{
				set_comm_time_out_frame(CabPort,frame);
			}
			del_cache_data(LayPort);
		}
	}
	//----------------------------------------------发送数据：广播数据只发两次
	Cache	=	get_cache_data(LayPort);
	if(0==Cache)	//无数据
	{
		ampsys.ReSend.Lay	=	0;
		ampsys.time.LaySendTime		=	5;
		return;
	}	
	//----------------------------------------------
	sendnum	=	api_rs485_dma_send(&ampRS485Ly,Cache->data,Cache->size);		//串口DMA发送程序，如果数据已经传入到DMA，返回Buffer大小，否则返回0
	if(sendnum)	//已将数据转移到缓存
	{	
		frame	=	(ampphydef*)Cache->data;		
		ampsys.ReSend.Lay+=1;			
		ampsys.time.LaySendTime	=	ampReSendTime;
		
		//--------------------------LED指示灯
		ampsys.led.flag.ly_tx	=	1;
		ampsys.led.time.ly_tx	=	ampledtime;
		
		//----------------------------------------------广播数据只发两次，不需要应答
		if((0xFF==frame->msg.addr.address2)||(0xFF==frame->msg.addr.address3))	//广播地址
		{
			if(ampsys.ReSend.Lay>=2)
			{
				ampsys.ReSend.Lay=0;
				del_cache_data(LayPort);
				del_ack_wait_flag(LayPort);			//0--无需等待应答，1--需等待应答
				return;
			}
		}
		else
		{
			set_ack_wait_flag(LayPort);			//0--无需等待应答，1--需等待应答
		}
	}		
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void cmd_process(ampphydef* frame)
{
	unsigned char	cab_addr	=	0;	//柜地址
	unsigned char cmd				=	0;
	unsigned char parameter	=	0;
	
	if(0==frame)
		return;
	
	cmd	=	frame->msg.cmd.cmd;
	cab_addr		=	frame->msg.addr.address1;		//柜地址
	parameter		=	frame->msg.data[0];				//如果是控制类消息时的请求标志
	
	if((0xFF!=cab_addr)&&(cab_addr!=ampsys.sysdata.Cab_Addr))	//地址
		return;
	//------------------------------与层板供电相关的命令1
	if((ampCmdLcdConf == cmd)||(ampCmdLcdData==cmd))       //LCD配置命令
  {
    set_layer_power(1);
  }
	
