quanhengwen/STM32F1xWorkSpace19/Examples/AMP/AMP01V14A1.C
	//------------------------------与层板供电相关的命令2
	if((ampCmdLed==cmd)||(ampCmdLcdPwr==cmd)||(ampCmdPwr==cmd))  //LED电源供电控制指令
  {
		set_layer_power(parameter);
  }
	
	//------------------------------与背光相关的命令
	if((ampCmdLed==cmd)||(ampCmdLcdPwr==cmd)||(ampCmdPwr==cmd)||(ampCmdBKligth==cmd))  //LED电源供电控制指令
  {
		set_backlight(parameter);
  }

	//------------------------------与开门相关的命令
	if(ampCmdLock ==  cmd)   //锁控制命令
  {
		set_door(parameter);
  }
	//------------------------------查询命令
  else if(ampCmdSta ==  cmd)   //查询状态
  {
    set_lock_status_frame();
		return;
  }
}

//------------------------------------------------------------------------------


//--------------------------------static-hardware_control
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_door(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampsys.request.unlock	=	0;
		ampsys.time.LockTime	=	0;	//开锁时间2秒
		ampResLock;
	}
	else
	{
		ampsys.request.unlock	=	1;
		ampsys.time.LockTime	=	ampUnlockOuttime;	//开锁时间2秒
		ampUnLock;
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_backlight(unsigned char flag)
{
	//flag不为0表示有请求
	//ampsys.sysdata.Display_Flag	=	1;	//透明屏标志://0--普通/无屏，1--主柜透明屏
	//---------------关背光
	if(0==flag)
	{
		if(0==ampsys.sysdata.Display_Flag)
			ampBakkLightOff;
		else
			ampBakkLightOn;
	}
	//---------------开背光
	else
	{
		if(0==ampsys.sysdata.Display_Flag)
			ampBakkLightOn;
		else
			ampBakkLightOff;
	}	
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 0-关闭，1-打开
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_layer_power(unsigned char flag)
{
	//flag不为0表示有请求
	if(0==flag)
	{
		ampLayPowerOff;
	}
	else
	{
		ampLayPowerOn;
	}	
}
//------------------------------------------------------------------------------


//--------------------------------static-set_frame
/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ackup_frame(ampPortDef Port)
{  
	ampphydef*	frame;

	ampAckDef* ack  = 0;
	if(PcPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Pc.Ack;
	else if(CabPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.commdata.CbAck;
	else if(LayPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.commdata.LyAck;
	else
		return ;	

	frame=(ampphydef*)ack;
	
	ack->head	=	headcode;
	ack->length	=	5;
	ack->cmd.cmd	=	ampCmdAck;
	ack->cmd.rv		=	0;
	ack->cmd.dir	=	1;
	ack->address1	=	ampsys.sysdata.Cab_Addr;		//向上应答为柜地址
	ack->address2	=	0;
	ack->address3	=	0;
	ack->status=0;
	
	api_set_frame(frame,ampCmdAck,1);    //补充消息的CRC和结束符，返回帧长度
	
	ack->flag		=	1;
}
/*******************************************************************************
*函数名			:	getframe
*功能描述		:	获取帧地址，返回帧长度
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_ackdown_frame(ampPortDef Port)
{  
  ampphydef*	frame;

	ampAckDef* ack  = 0;
	if(PcPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.Pc.Ack;
	else if(CabPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.commdata.CbAck;
	else if(LayPort	==	Port)
		ack	=	(ampAckDef*)&ampsys.commdata.LyAck;
	else
		return;	

	frame=(ampphydef*)ack;
	
	frame->head	=	headcode;
	frame->msg.length	=	5;
	frame->msg.cmd.cmd	=	ampCmdAck;
	frame->msg.cmd.rv		=	0;
	frame->msg.cmd.dir	=	0;
	frame->msg.addr.address1	=	0x00;		//向下应答无地址
	frame->msg.addr.address2	=	0;
	frame->msg.addr.address3	=	0;
	frame->msg.data[0]=0;

	api_set_frame(frame,ampCmdAck,0);    //补充消息的CRC和结束符，返回帧长度
	
	ack->flag		=	1;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_lock_status_frame(void)
{
	ampphydef	frame;
	frame.head	=	headcode;
	frame.msg.length	=	6;		//cmd,addr1,addr2,addr3,data0,data1
	frame.msg.cmd.cmd	=	ampCmdLock;
	frame.msg.cmd.rv	=	0;
	frame.msg.cmd.dir	=	1;
	frame.msg.addr.address1	=	ampsys.sysdata.Cab_Addr;
	frame.msg.addr.address2	=	0;
	frame.msg.addr.address3	=	0;
	frame.msg.data[0]	=	ampStypeLock;
	frame.msg.data[1]	=	ampsys.status.lock;
	
	api_set_frame(&frame,ampCmdLock,ampDirUp);		//设置消息帧
	
	if(ampsys.sysdata.MB_Flag)	//主板
		set_cache_data(PcPort,&frame);
	else
		set_cache_data(CabPort,&frame);
}
/*******************************************************************************
*函数名			:	LockStatusUpdata
*功能描述		:	上报锁状态
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void set_comm_time_out_frame(ampPortDef Port,ampphydef* frame)
{
//  unsigned char databuffer[32]={0};
//  unsigned short framlength = 0;  //生成的消息长度
//  unsigned short datalength = 2;  //需要上报的数据字节数
  ampphydef  ampframe;
	
	ampframe.head	=	headcode;
	ampframe.msg.length		=	6;
	ampframe.msg.cmd.cmd	=	ampCmdSta;
	ampframe.msg.cmd.rv		=	0;
	ampframe.msg.cmd.dir	=	1;
	ampframe.msg.addr.address1	=	frame->msg.addr.address1;
	ampframe.msg.addr.address2	=	frame->msg.addr.address2;
	ampframe.msg.addr.address3	=	frame->msg.addr.address3;
	ampframe.msg.data[0]	=	ampStypeComm;
	ampframe.msg.data[1]	=	AmpCommTimeOut;
	
  switch(Port)
  {
    case  NonPort   : return ;   //不继续执行
    case  PcPort    : break;    //PC接口发送缓存
    case  CabPort   ://柜接口发送缓存
                      ampframe.msg.addr.address2 = 0;
                      ampframe.msg.addr.address3 = 0;
      break;
    case  LayPort   ://层接口发送缓存
      break;
    case  CardPort  ://读卡器接口发送缓存
      break;
    default :return;      //不继续执行 
  }
	api_set_frame(&ampframe,ampCmdSta,1);
	set_cache_data(Port,&ampframe);
}
//------------------------------------------------------------------------------


//--------------------------------static-Server
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
static void SwitchID_Server(void)
{
  static unsigned char id=0;
  static unsigned char power_on_flag=0; //上电时为0

	if(0!=ampsys.time.swicthidtime)
		return;
	ampsys.time.swicthidtime	=	2000;
  if(0==power_on_flag)  //刚上电
  {
    power_on_flag = 1;  //已上电完成
    id  = api_get_SwitchId_data_left(&ampSwitchID);
		if(id&0x80)
			ampsys.sysdata.MB_Flag	=	1;
		else
			ampsys.sysdata.MB_Flag	=	0;
		
